app/admin/projects.rb

SELECT "users".* FROM "users"
---
      f.input :start_date
      f.input :end_date
      f.input :description
      f.input :assigned_users, as: :select, collection: User.all, multiple: true

INSERT INTO "projects" ("user_id", "project_name", "status", "start_date", "end_date", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "users"."id" FROM "users" WHERE "users"."id" IS NULL
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
      @project = Project.new(permitted_params[:project])
      if @project.save
      @members = params[:assigned_user_id].reject(&:empty?) if params[:assigned_user_ids].present?

      @members = User.where(id: @members).pluck(:id)
        if @members.any?