app/admin/users.rb

INSERT INTO "users" ("email", "password_digest", "name", "username", "designation", "employee_id_number", "roles", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create

        roles = params[:user][:roles].split(",")
        email = params[:user][:email]
        designation = params[:user][:designation]
        password = params[:user][:password]
        password_confirmation = params[:user][:password_confirmation]
        employee_id_number = params[:user][:employee_id_number]
        username = params[:user][:username]
        namee = params[:user][:name]
        user = User.new(roles: roles, email: email,designation: designation,password: password,employee_id_number: employee_id_number,password_confirmation: password_confirmation,username: username,name: namee)
      if user.save