app/controllers/personal_details_controller.rb

		def index
		 @personal_detail = @current_user.personal_detail

		  if @personal_detail.present?
---
SELECT "personal_details".* FROM "personal_details" WHERE "personal_details"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

	  def create

	       @personal_detail = PersonalDetail.find_by_user_id(@current_user.id)

	      params.merge!(user_id: @current_user.id) if params.present?
	    if !@personal_detail.present?
	       @personal_detail = PersonalDetail.new
	    end
	    if @personal_detail.update(personal_detail_params)

	    	ActivityTracker.create(
      headings: 'Personal Details Update',
      contents: "#{@current_user.name} has updated Personal details.",
      user_id: @personal_detail.user_id,
      action_needed: true,
      notification_type: 'Personal Details Update',
      notification_type_id: @personal_detail.id,
      guest_id: @personal_detail.user_id
    )
---
SELECT "personal_details".* FROM "personal_details" WHERE "personal_details"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "personal_details" WHERE "personal_details"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "personal_details" ("user_id", "first_name", "last_name", "date_of_birth", "gender", "nationality", "marital_status", "mobile_number", "aadhar_card_number", "pan_card_number", "company_email", "personal_email", "present_address", "permanent_address", "created_at", "updated_at", "profile_pic") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
INSERT INTO "activity_trackers" ("headings", "contents", "action_needed", "guest_id", "notification_type", "notification_type_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"