app/controllers/skills_controller.rb

INSERT INTO "skills" ("user_id", "skill_name", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["skill_name", "Aws"], ["rating", 4.5], ["created_at", "2024-08-12 07:29:26.340773"], ["updated_at", "2024-08-12 07:29:26.340773"]]
---
    def create
      params.merge!(user_id: @current_user.id) if params.present?
      @skill = Skill.new(skill_params)
      if @skill.save