app/controllers/work_experiences_controller.rb

  def create
    params.merge!(user_id: @current_user.id) if params.present?
    @work_experience = WorkExperience.new(experience_params)
    if @work_experience.save
---
INSERT INTO "work_experiences" ("user_id", "organization_name", "designation", "date_of_join", "date_of_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"